In [11]:
person = {
    "first": "Corey",
    "last": "Schafer",
    "email": "coreschafter8@gmail.com"
}

In [12]:
people = {
    "first": ["Corey"],
    "last": ["Schafer"],
    "email": ["coreschafter8@gmail.com"]
}

In [13]:
people = {
    "first": ["Corey", 'Jane', 'John'],
    "last": ["Schafer", 'Doe', 'Doe'],
    "email": ["coreschafter8@gmail.com", 'janedoe@gmail.com',
              'Johndoe@gmail.com']
}

In [14]:
people['email']

['coreschafter8@gmail.com', 'janedoe@gmail.com', 'Johndoe@gmail.com']

In [15]:
import pandas as pd

In [16]:
df = pd.DataFrame(people)

In [66]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com

In [67]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [17]:
df['full_name'] = df['first'] + ' ' + df['last']

In [69]:
df

   first     last                    email      full_name
0  Corey  Schafer  coreschafter8@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@gmail.com       Jane Doe
2   John      Doe        Johndoe@gmail.com       John Doe

In [71]:
df.drop(columns=['first', 'last'], inplace=True)

In [72]:
df

                     email      full_name
0  coreschafter8@gmail.com  Corey Schafer
1        janedoe@gmail.com       Jane Doe
2        Johndoe@gmail.com       John Doe

In [73]:
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [48]:
# df['email']

0    coreschafter8@gmail.com
1          janedoe@gmail.com
2          Johndoe@gmail.com
Name: email, dtype: object

In [49]:
# type(df['email'])

In [50]:
df.email

0    coreschafter8@gmail.com
1          janedoe@gmail.com
2          Johndoe@gmail.com
Name: email, dtype: object

In [51]:
df[['last', 'email']]

      last                    email
0  Schafer  coreschafter8@gmail.com
1      Doe        janedoe@gmail.com
2      Doe        Johndoe@gmail.com

In [52]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [53]:
df.iloc[[0, 1], 2]
#iloc use interger locations.
#Make sure you pass a double bracket so it can fetch the below data
# as intended

0    coreschafter8@gmail.com
1          janedoe@gmail.com
Name: email, dtype: object

In [54]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com

In [55]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [56]:
df.columns = ['first_name', 'last_name', 'email']

In [57]:
#TO CHANGE THE TITLE OF THE COLUMN TO UPPERCASE OR LOWERCASE
# df.columns = [x.upper() for x in df.columns]
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  coreschafter8@gmail.com
1       Jane       Doe        janedoe@gmail.com
2       John       Doe        Johndoe@gmail.com

In [58]:
#TO REPLACE THE COLUMNS THAT HAS SPACE WITH UNDERSCORE OR OTHERWISE
#USING THE .STRING METHOD
df.columns = df.columns.str.replace(' ', '_')
df

  first_name last_name                    email
0      Corey   Schafer  coreschafter8@gmail.com
1       Jane       Doe        janedoe@gmail.com
2       John       Doe        Johndoe@gmail.com

In [59]:
#TO CHANGE SOME COLUMNS(RENAME)
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [60]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com

In [61]:
df.loc[2] = ['John', 'Smith', 'Johnsmith@email.com']

In [62]:
df.loc[2, ['last', 'email']] = ['Doe', 'Johnsmith@email.com']

In [63]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe      Johnsmith@email.com

In [64]:
df.loc[2, 'last'] = 'Smith'

In [65]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John    Smith      Johnsmith@email.com

In [66]:
#DOES THE SAME FUNCTION AS .LOC
df.at[2, 'last'] = 'Doe'

In [67]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe      Johnsmith@email.com

In [68]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Doe'

In [69]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe      Johnsmith@email.com

In [70]:
#we can use labels for loc
# df.loc[[0, 1], ['email', 'last']]

In [71]:
filt = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [72]:
#BIG NOTE :
#.loc IS USED TO LOOK UP FOR ROWS AND COLUMNS 
#IF WE USE A LABEL OR BY LABEL

# df.loc[filt]
# =======================
# THE USE OF AND (&) OR(|)
# filt = (df['last'] == 'Schafer') & (df['first'] == 'John')
# filt = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [73]:
#NOTE THE PARAMETER WE PASSED INSIDE THE BRACKET. 
#.LOC THE FIRST VALUE IS THE ROW
# AND THE SECOND VALUES ARE THE COLUMNS THAT WE WANT
df.loc[-filt, 'email']

1    janedoe@gmail.com
Name: email, dtype: object

In [74]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Doe'

In [75]:
df['email'] = df['email'].str.lower()

In [18]:
df

   first     last                    email      full_name
0  Corey  Schafer  coreschafter8@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@gmail.com       Jane Doe
2   John      Doe        Johndoe@gmail.com       John Doe

In [77]:
#MORE ADVANCED METHOD TO CHANGE MULTIPLE ROW AT ONCE.
# apply
# map
# applymap
# replace

In [78]:
# Apply is used for calling a function on our values and it 
# can work on either a dataframe or a series object

In [79]:
df['email'].apply(len)

0    23
1    17
2    19
Name: email, dtype: int64

In [80]:
def update_email(email):
    return email.upper()

In [81]:
df['email'].apply(update_email)

0    CORESCHAFTER8@GMAIL.COM
1          JANEDOE@GMAIL.COM
2        JOHNSMITH@EMAIL.COM
Name: email, dtype: object

In [82]:
df['email'] = df['email'].apply(update_email)

In [83]:
df

   first     last                    email
0  Corey  Schafer  CORESCHAFTER8@GMAIL.COM
1   Jane      Doe        JANEDOE@GMAIL.COM
2   John      Doe      JOHNSMITH@EMAIL.COM

In [84]:
# LAMBDA FUNCTION
df['email'] = df['email'].apply(lambda x: x.lower())

In [85]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe      johnsmith@email.com

In [86]:
df['email'].apply(len)

0    23
1    17
2    19
Name: email, dtype: int64

In [87]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [88]:
len(df['email'])

3

In [89]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreschafter8@gmail.com
dtype: object

In [90]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreschafter8@gmail.com
dtype: object

In [91]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     19

In [19]:
df.applymap(str.lower)

   first     last                    email      full_name
0  corey  schafer  coreschafter8@gmail.com  corey schafer
1   jane      doe        janedoe@gmail.com       jane doe
2   john      doe        johndoe@gmail.com       john doe

In [20]:
#DEALING WITH NAN
df['first'].map({'Corey':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [98]:
#DEALING WITH NAN
# df['first'].replace({'Corey':'Chris','Jane':'Mary'})
df['first'] = df['first'].replace({'Corey':'Chris','Jane':'Mary'})

In [10]:
df

   first     last                    email
0  Corey  Schafer  coreschafter8@gmail.com
1   Jane      Doe        janedoe@gmail.com
2   John      Doe        Johndoe@gmail.com

In [22]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [23]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [24]:
df

   first     last                    email      full_name
0  Corey  Schafer  coreschafter8@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@gmail.com       Jane Doe
2   John      Doe        Johndoe@gmail.com       John Doe

In [27]:
df.append({'first': 'Tony'}, ignore_index=True)

C:\Users\23470\AppData\Local\Temp\ipykernel_7696\67547244.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first': 'Tony'}, ignore_index=True)

   first     last                    email      full_name
0  Corey  Schafer  coreschafter8@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@gmail.com       Jane Doe
2   John      Doe        Johndoe@gmail.com       John Doe
3   Tony      NaN                      NaN            NaN

In [29]:
people = {
    "first": ["Tony", 'Steve'],
    "last": ["Stark", 'Rogers'],
    "email": ["Ironman@avenge.com", 'cap@avenge.com']
}

df2 = pd.DataFrame(people)

In [30]:
df2

   first    last               email
0   Tony   Stark  Ironman@avenge.com
1  Steve  Rogers      cap@avenge.com

In [35]:
df.append(df2, ignore_index=True, sort=False)

C:\Users\23470\AppData\Local\Temp\ipykernel_7696\2503217469.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False)

   first     last                    email      full_name
0  Corey  Schafer  coreschafter8@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@gmail.com       Jane Doe
2   John      Doe        Johndoe@gmail.com       John Doe
3   Tony    Stark       Ironman@avenge.com            NaN
4  Steve   Rogers           cap@avenge.com            NaN

In [36]:
df = df.append(df2, ignore_index=True, sort=False)

C:\Users\23470\AppData\Local\Temp\ipykernel_7696\3370980109.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

In [37]:
df

   first     last                    email      full_name
0  Corey  Schafer  coreschafter8@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@gmail.com       Jane Doe
2   John      Doe        Johndoe@gmail.com       John Doe
3   Tony    Stark       Ironman@avenge.com            NaN
4  Steve   Rogers           cap@avenge.com            NaN

In [38]:
df.drop(index=4)

   first     last                    email      full_name
0  Corey  Schafer  coreschafter8@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@gmail.com       Jane Doe
2   John      Doe        Johndoe@gmail.com       John Doe
3   Tony    Stark       Ironman@avenge.com            NaN

In [46]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

   first     last                    email      full_name
0  Corey  Schafer  coreschafter8@gmail.com  Corey Schafer
3   Tony    Stark       Ironman@avenge.com            NaN
4  Steve   Rogers           cap@avenge.com            NaN